In [2]:
import pandas as pd # import pandas for dataframes
import numpy as np # import numpy for numeric operations

## CAPSTONE PROJECT

Task 1: Create DataFrames and save as CSVs
============

*Create the Employee DataFrame with the values from the project brief*

In [14]:
# start employee data dict
employees_data = pd.DataFrame({   
    'ID': ['A001', 'A002', 'A003', 'A004', 'A005'],  # employee IDs  
    'Name': ['John Alter', 'Alice Luxumberg', 'Tom Sabestine', 'Nina Adgra', 'Amy Johny'],  # full names  
    'Gender': ['M', 'F', 'M', 'F', 'F'],  # genders  
    'City': ['Paris', 'London', 'Berlin', 'Newyork', 'Madrid'],  # cities  
    'Age': [25, 27, 29, 31, 30]})  # ages  
employees_data

     ID             Name Gender     City  Age
0  A001       John Alter      M    Paris   25
1  A002  Alice Luxumberg      F   London   27
2  A003    Tom Sabestine      M   Berlin   29
3  A004       Nina Adgra      F  Newyork   31
4  A005        Amy Johny      F   Madrid   30

In [15]:
 # end employee data dict  
employees_df = pd.DataFrame(employees_data)  # build employees dataframe  
employees_df.to_csv('employees.csv', index=False)  # save employees dataframe to CSV

In [16]:
data_load=pd.read_csv("employees.csv")
print(data_load)

     ID             Name Gender     City  Age
0  A001       John Alter      M    Paris   25
1  A002  Alice Luxumberg      F   London   27
2  A003    Tom Sabestine      M   Berlin   29
3  A004       Nina Adgra      F  Newyork   31
4  A005        Amy Johny      F   Madrid   30

In [17]:
# Create the Seniority/Designation DataFrame  # comment
# start seniority dict
seniority_data = pd.DataFrame({    
    'ID': ['A001', 'A002', 'A003', 'A004', 'A005'],  # employee IDs repeated  
    'Designation Level': [2, 2, 3, 2, 3]})  # designation levels  
seniority_data

     ID  Designation Level
0  A001                  2
1  A002                  2
2  A003                  3
3  A004                  2
4  A005                  3

In [18]:
 # end seniority dict  
seniority_df = pd.DataFrame(seniority_data)  # build seniority dataframe  
seniority_df.to_csv('seniority.csv', index=False)  # save seniority dataframe to CSV

In [19]:
file=pd.read_csv("seniority.csv")
print(file)

     ID  Designation Level
0  A001                  2
1  A002                  2
2  A003                  3
3  A004                  2
4  A005                  3

In [20]:
# Create the Project DataFrame
project_data = pd.DataFrame({
    'ID': ["A001", "A002", "A003", "A004", "A005", "A002", "A005", "A003", "A001", "A003", "A001", "A004", "A004", "A005"],
    "Project":["Project 1", "Project 2", "Project 3", "Project 4", "Project 5", "Project 6", "Project 7", "Project 8", "Project 9", "Project 10","Project 11", "Project 12", "Project 13", "Project 14"],
    "Cost": [1002000, 2000000, 4500000, 5500000, np.nan, 680000, 400000, 350000, np.nan, 300000, 2000000, 1000000, 3000000, 200000],
    "Status": ["Finished", "Ongoing", "Finished", "Ongoing", "Finished", "Failed", "Finished", "Failed", "Ongoing", "Finished", "Failed", "Ongoing", "Finished", "Finished"]
    
})
project_data

      ID     Project       Cost    Status
0   A001   Project 1  1002000.0  Finished
1   A002   Project 2  2000000.0   Ongoing
2   A003   Project 3  4500000.0  Finished
3   A004   Project 4  5500000.0   Ongoing
4   A005   Project 5        NaN  Finished
5   A002   Project 6   680000.0    Failed
6   A005   Project 7   400000.0  Finished
7   A003   Project 8   350000.0    Failed
8   A001   Project 9        NaN   Ongoing
9   A003  Project 10   300000.0  Finished
10  A001  Project 11  2000000.0    Failed
11  A004  Project 12  1000000.0   Ongoing
12  A004  Project 13  3000000.0  Finished
13  A005  Project 14   200000.0  Finished

In [21]:
project_df = pd.DataFrame(project_data)  # build projects dataframe  
project_df.to_csv('projects.csv', index=False)  # save projects dataframe to CSV

In [22]:
df_load=pd.read_csv("projects.csv")
print(df_load)

      ID     Project       Cost    Status
0   A001   Project 1  1002000.0  Finished
1   A002   Project 2  2000000.0   Ongoing
2   A003   Project 3  4500000.0  Finished
3   A004   Project 4  5500000.0   Ongoing
4   A005   Project 5        NaN  Finished
5   A002   Project 6   680000.0    Failed
6   A005   Project 7   400000.0  Finished
7   A003   Project 8   350000.0    Failed
8   A001   Project 9        NaN   Ongoing
9   A003  Project 10   300000.0  Finished
10  A001  Project 11  2000000.0    Failed
11  A004  Project 12  1000000.0   Ongoing
12  A004  Project 13  3000000.0  Finished
13  A005  Project 14   200000.0  Finished

Task 2: Compute missing Project Cost values using running average (use for-loop)
==

In [23]:
# Example: project_df already exists
# project_df["Cost"] = pd.to_numeric(project_df["Cost"], errors="coerce")

project_df["Cost"]= pd.to_numeric(project_df["Cost"], errors="coerce")
project_df

      ID     Project       Cost    Status
0   A001   Project 1  1002000.0  Finished
1   A002   Project 2  2000000.0   Ongoing
2   A003   Project 3  4500000.0  Finished
3   A004   Project 4  5500000.0   Ongoing
4   A005   Project 5        NaN  Finished
5   A002   Project 6   680000.0    Failed
6   A005   Project 7   400000.0  Finished
7   A003   Project 8   350000.0    Failed
8   A001   Project 9        NaN   Ongoing
9   A003  Project 10   300000.0  Finished
10  A001  Project 11  2000000.0    Failed
11  A004  Project 12  1000000.0   Ongoing
12  A004  Project 13  3000000.0  Finished
13  A005  Project 14   200000.0  Finished

In [100]:
# Dataframe
Project = pd.DataFrame({
    'ID': ["A001", "A002", "A003", "A004", "A005", "A002", "A005", "A003", "A001", "A003", "A001", "A004", "A004", "A005"],
    "Project":["Project 1", "Project 2", "Project 3", "Project 4", "Project 5", "Project 6", "Project 7", "Project 8", "Project 9", "Project 10","Project 11", "Project 12", "Project 13", "Project 14"],
    "Cost": [1002000, 2000000, 4500000, 5500000, np.nan, 680000, 400000, 350000, np.nan, 300000, 2000000, 1000000, 3000000, 200000],
    "Status": ["Finished", "Ongoing", "Finished", "Ongoing", "Finished", "Failed", "Finished", "Failed", "Ongoing", "Finished", "Failed", "Ongoing", "Finished", "Finished"]
    
})

print("Original DataFrame:")
print(Project)

# Replace missing values in 'cost' with running average using a for loop
for i in range(len(Project)):
    if pd.isna(Project.loc[i, "Cost"]):  # check if value is NaN
        # Take average of all previous non-missing values
        prev_values = Project.loc[:i-1, "Cost"].dropna()
        if len(prev_values) > 0:
            Project.loc[i, "Cost"] = prev_values.mean()

print("\nDataFrame after replacing missing values:")
print(Project)

Project.to_csv("projects.csv")

Original DataFrame:
      ID     Project       Cost    Status
0   A001   Project 1  1002000.0  Finished
1   A002   Project 2  2000000.0   Ongoing
2   A003   Project 3  4500000.0  Finished
3   A004   Project 4  5500000.0   Ongoing
4   A005   Project 5        NaN  Finished
5   A002   Project 6   680000.0    Failed
6   A005   Project 7   400000.0  Finished
7   A003   Project 8   350000.0    Failed
8   A001   Project 9        NaN   Ongoing
9   A003  Project 10   300000.0  Finished
10  A001  Project 11  2000000.0    Failed
11  A004  Project 12  1000000.0   Ongoing
12  A004  Project 13  3000000.0  Finished
13  A005  Project 14   200000.0  Finished

DataFrame after replacing missing values:
      ID     Project       Cost    Status
0   A001   Project 1  1002000.0  Finished
1   A002   Project 2  2000000.0   Ongoing
2   A003   Project 3  4500000.0  Finished
3   A004   Project 4  5500000.0   Ongoing
4   A005   Project 5  3250500.0  Finished
5   A002   Project 6   680000.0    Failed
6   A005   Project 7   400000.0  Finished
7   A003   Project 8   350000.0    Failed
8   A001   Project 9  2210312.5   Ongoing
9   A003  Project 10   300000.0  Finished
10  A001  Project 11  2000000.0    Failed
11  A004  Project 12  1000000.0   Ongoing
12  A004  Project 13  3000000.0  Finished
13  A005  Project 14   200000.0  Finished

Task 3: Split Name into First Name and Last Name and drop old Name column
==

In [94]:
employee = pd.DataFrame({   
    'ID': ['A001', 'A002', 'A003', 'A004', 'A005'],  # employee IDs  
    'Name': ['John Alter', 'Alice Luxumberg', 'Tom Sabestine', 'Nina Adgra', 'Amy Johny'],  # full names  
    'Gender': ['M', 'F', 'M', 'F', 'F'],  # genders  
    'City': ['Paris', 'London', 'Berlin', 'Newyork', 'Madrid'],  # cities  
    'Age': [25, 27, 29, 31, 30]})  # ages  
print("Original DataFrame:")
print(employee)


employee[['First_name', 'Last_name']]= employee['Name'].str.split(' ',n=1, expand=True)

employee.drop(columns=['Name'], inplace=True)

print("\nDataFrame after Split name into first_name and Last_Name:")
print(employee)

employee.to_csv("employees.csv")

Original DataFrame:
     ID             Name Gender     City  Age
0  A001       John Alter      M    Paris   25
1  A002  Alice Luxumberg      F   London   27
2  A003    Tom Sabestine      M   Berlin   29
3  A004       Nina Adgra      F  Newyork   31
4  A005        Amy Johny      F   Madrid   30

DataFrame after Split name into first_name and Last_Name:
     ID Gender     City  Age First_name  Last_name
0  A001      M    Paris   25       John      Alter
1  A002      F   London   27      Alice  Luxumberg
2  A003      M   Berlin   29        Tom  Sabestine
3  A004      F  Newyork   31       Nina      Adgra
4  A005      F   Madrid   30        Amy      Johny

Task 4: Join all three DataFrames into a single DataFrame 
===

In [12]:
employee_df = pd.read_csv("employees.csv")
project_df = pd.read_csv("projects.csv")
seniority_df = pd.read_csv("seniority.csv")
print(employee_df)
print(project_df)
print(seniority_df)

   Unnamed: 0    ID Gender     City  Age First_name  Last_name
0           0  A001      M    Paris   25       John      Alter
1           1  A002      F   London   27      Alice  Luxumberg
2           2  A003      M   Berlin   29        Tom  Sabestine
3           3  A004      F  Newyork   31       Nina      Adgra
4           4  A005      F   Madrid   30        Amy      Johny
    Unnamed: 0    ID     Project       Cost    Status
0            0  A001   Project 1  1002000.0  Finished
1            1  A002   Project 2  2000000.0   Ongoing
2            2  A003   Project 3  4500000.0  Finished
3            3  A004   Project 4  5500000.0   Ongoing
4            4  A005   Project 5  3250500.0  Finished
5            5  A002   Project 6   680000.0    Failed
6            6  A005   Project 7   400000.0  Finished
7            7  A003   Project 8   350000.0    Failed
8            8  A001   Project 9  2210312.5   Ongoing
9            9  A003  Project 10   300000.0  Finished
10          10  A001  Project 11  2000000.0    Failed
11          11  A004  Project 12  1000000.0   Ongoing
12          12  A004  Project 13  3000000.0  Finished
13          13  A005  Project 14   200000.0  Finished
     ID  Designation Level
0  A001                  2
1  A002                  2
2  A003                  3
3  A004                  2
4  A005                  3

In [13]:
merged_df = employee_df.merge(seniority_df, on="ID", how='left')
final = merged_df.merge(project_df, on="ID", how='left')
final.to_csv('Final.csv', index=False)

In [15]:
f=pd.read_csv("Final.csv")
print(f)

    Unnamed: 0_x    ID Gender     City  Age First_name  Last_name  \
0              0  A001      M    Paris   25       John      Alter
1              0  A001      M    Paris   25       John      Alter
2              0  A001      M    Paris   25       John      Alter
3              1  A002      F   London   27      Alice  Luxumberg
4              1  A002      F   London   27      Alice  Luxumberg
5              2  A003      M   Berlin   29        Tom  Sabestine
6              2  A003      M   Berlin   29        Tom  Sabestine
7              2  A003      M   Berlin   29        Tom  Sabestine
8              3  A004      F  Newyork   31       Nina      Adgra
9              3  A004      F  Newyork   31       Nina      Adgra
10             3  A004      F  Newyork   31       Nina      Adgra
11             4  A005      F   Madrid   30        Amy      Johny
12             4  A005      F   Madrid   30        Amy      Johny
13             4  A005      F   Madrid   30        Amy      Johny

    Designation Level  Unnamed: 0_y     Project       Cost    Status
0                   2             0   Project 1  1002000.0  Finished
1                   2             8   Project 9  2210312.5   Ongoing
2                   2            10  Project 11  2000000.0    Failed
3                   2             1   Project 2  2000000.0   Ongoing
4                   2             5   Project 6   680000.0    Failed
5                   3             2   Project 3  4500000.0  Finished
6                   3             7   Project 8   350000.0    Failed
7                   3             9  Project 10   300000.0  Finished
8                   2             3   Project 4  5500000.0   Ongoing
9                   2            11  Project 12  1000000.0   Ongoing
10                  2            12  Project 13  3000000.0  Finished
11                  3             4   Project 5  3250500.0  Finished
12                  3             6   Project 7   400000.0  Finished
13                  3            13  Project 14   200000.0  Finished

Task 5: Add a 5% bonus for employees who finished projects
==

In [20]:
# Add Bonus column equal to 5% of Project Cost when Status is 'Finished', else 0  # comment
final['Bonus'] = np.where(final['Status'].str.strip().str.lower() == 'finished', final['Cost'] * 0.05, 0.0)  # compute bonus per row  
# Save after adding bonus for record-keeping  # comment
final.to_csv('Final_with_bonus.csv', index=False)  # save final with bonus to CSV

In [38]:
Final=pd.read_csv('final_with_bonus.csv')
print(Final)

    Unnamed: 0_x    ID Gender     City  Age First_name  Last_name  \
0              0  A001      M    Paris   25       John      Alter
1              0  A001      M    Paris   25       John      Alter
2              0  A001      M    Paris   25       John      Alter
3              1  A002      F   London   27      Alice  Luxumberg
4              1  A002      F   London   27      Alice  Luxumberg
5              2  A003      M   Berlin   29        Tom  Sabestine
6              2  A003      M   Berlin   29        Tom  Sabestine
7              2  A003      M   Berlin   29        Tom  Sabestine
8              3  A004      F  Newyork   31       Nina      Adgra
9              3  A004      F  Newyork   31       Nina      Adgra
10             3  A004      F  Newyork   31       Nina      Adgra
11             4  A005      F   Madrid   30        Amy      Johny
12             4  A005      F   Madrid   30        Amy      Johny
13             4  A005      F   Madrid   30        Amy      Johny

    Designation Level  Unnamed: 0_y     Project       Cost    Status     Bonus
0                   2             0   Project 1  1002000.0  Finished   50100.0
1                   2             8   Project 9  2210312.5   Ongoing       0.0
2                   2            10  Project 11  2000000.0    Failed       0.0
3                   2             1   Project 2  2000000.0   Ongoing       0.0
4                   2             5   Project 6   680000.0    Failed       0.0
5                   3             2   Project 3  4500000.0  Finished  225000.0
6                   3             7   Project 8   350000.0    Failed       0.0
7                   3             9  Project 10   300000.0  Finished   15000.0
8                   2             3   Project 4  5500000.0   Ongoing       0.0
9                   2            11  Project 12  1000000.0   Ongoing       0.0
10                  2            12  Project 13  3000000.0  Finished  150000.0
11                  3             4   Project 5  3250500.0  Finished  162525.0
12                  3             6   Project 7   400000.0  Finished   20000.0
13                  3            13  Project 14   200000.0  Finished   10000.0

Task 6: Demote designation by 1 if project status is 'Failed' and delete employees with designation >4
====

In [23]:
failed_mask = final['Status'].str.strip().str.lower() == 'Failed'  # boolean mask for failed projects  
final.loc[failed_mask, 'Designation Level'] = final.loc[failed_mask, 'Designation Level'] - 1  # decrement designation level  
# Remove rows (employee records) where designation level is now above 4 (ineligible)  # comment
final = final[final['Designation Level'] <= 4].copy()  # keep only rows with designation <= 4  
# Save after demotion and deletion  # comment
final.to_csv('Final_after_demotion.csv', index=False)  # save file

In [41]:
final_status=pd.read_csv("final_after_demotion.csv")
print(final_status)

    Unnamed: 0_x    ID Gender     City  Age First_name  Last_name  \
0              0  A001      M    Paris   25       John      Alter
1              0  A001      M    Paris   25       John      Alter
2              0  A001      M    Paris   25       John      Alter
3              1  A002      F   London   27      Alice  Luxumberg
4              1  A002      F   London   27      Alice  Luxumberg
5              2  A003      M   Berlin   29        Tom  Sabestine
6              2  A003      M   Berlin   29        Tom  Sabestine
7              2  A003      M   Berlin   29        Tom  Sabestine
8              3  A004      F  Newyork   31       Nina      Adgra
9              3  A004      F  Newyork   31       Nina      Adgra
10             3  A004      F  Newyork   31       Nina      Adgra
11             4  A005      F   Madrid   30        Amy      Johny
12             4  A005      F   Madrid   30        Amy      Johny
13             4  A005      F   Madrid   30        Amy      Johny

    Designation Level  Unnamed: 0_y     Project       Cost    Status     Bonus
0                   2             0   Project 1  1002000.0  Finished   50100.0
1                   2             8   Project 9  2210312.5   Ongoing       0.0
2                   2            10  Project 11  2000000.0    Failed       0.0
3                   2             1   Project 2  2000000.0   Ongoing       0.0
4                   2             5   Project 6   680000.0    Failed       0.0
5                   3             2   Project 3  4500000.0  Finished  225000.0
6                   3             7   Project 8   350000.0    Failed       0.0
7                   3             9  Project 10   300000.0  Finished   15000.0
8                   2             3   Project 4  5500000.0   Ongoing       0.0
9                   2            11  Project 12  1000000.0   Ongoing       0.0
10                  2            12  Project 13  3000000.0  Finished  150000.0
11                  3             4   Project 5  3250500.0  Finished  162525.0
12                  3             6   Project 7   400000.0  Finished   20000.0
13                  3            13  Project 14   200000.0  Finished   10000.0

Task 7: Prefix First Name with Mr./Mrs. and drop Gender column
==

In [25]:
# Add Mr. or Mrs. based on Gender and then drop the Gender column  # comment
final['First_name'] = np.where(final['Gender'] == 'M', 'Mr. ' + final['First_name'], 'Mrs. ' + final['First_name'])  # prefix titles  
final.drop(columns=['Gender'], inplace=True)  # drop the Gender column as requested  
# Save after adding titles  # comment
final.to_csv('Final_with_titles.csv', index=False)  # save file

In [45]:
final_with_prefix=pd.read_csv("Final_with_titles.csv")
print(final_with_prefix)

    Unnamed: 0_x    ID     City  Age  First_name  Last_name  \
0              0  A001    Paris   25    Mr. John      Alter
1              0  A001    Paris   25    Mr. John      Alter
2              0  A001    Paris   25    Mr. John      Alter
3              1  A002   London   27  Mrs. Alice  Luxumberg
4              1  A002   London   27  Mrs. Alice  Luxumberg
5              2  A003   Berlin   29     Mr. Tom  Sabestine
6              2  A003   Berlin   29     Mr. Tom  Sabestine
7              2  A003   Berlin   29     Mr. Tom  Sabestine
8              3  A004  Newyork   31   Mrs. Nina      Adgra
9              3  A004  Newyork   31   Mrs. Nina      Adgra
10             3  A004  Newyork   31   Mrs. Nina      Adgra
11             4  A005   Madrid   30    Mrs. Amy      Johny
12             4  A005   Madrid   30    Mrs. Amy      Johny
13             4  A005   Madrid   30    Mrs. Amy      Johny

    Designation Level  Unnamed: 0_y     Project       Cost    Status     Bonus
0                   2             0   Project 1  1002000.0  Finished   50100.0
1                   2             8   Project 9  2210312.5   Ongoing       0.0
2                   2            10  Project 11  2000000.0    Failed       0.0
3                   2             1   Project 2  2000000.0   Ongoing       0.0
4                   2             5   Project 6   680000.0    Failed       0.0
5                   3             2   Project 3  4500000.0  Finished  225000.0
6                   3             7   Project 8   350000.0    Failed       0.0
7                   3             9  Project 10   300000.0  Finished   15000.0
8                   2             3   Project 4  5500000.0   Ongoing       0.0
9                   2            11  Project 12  1000000.0   Ongoing       0.0
10                  2            12  Project 13  3000000.0  Finished  150000.0
11                  3             4   Project 5  3250500.0  Finished  162525.0
12                  3             6   Project 7   400000.0  Finished   20000.0
13                  3            13  Project 14   200000.0  Finished   10000.0

Task 8: Promote designation by 1 for employees whose Age > 29
==

In [46]:
# Increase designation level by 1 for employees older than 29 years using an IF-style condition  # comment
age_mask = final['Age'] > 29  # boolean mask where age > 29  
final.loc[age_mask, 'Designation Level'] = final.loc[age_mask, 'Designation Level'] + 1  # increment designation level  
# Save after promotion step  # comment
final.to_csv('Final_after_promotion.csv', index=False)  # save file

In [49]:
final_after_promotion=pd.read_csv("Final_after_promotion.csv")
print(final_after_promotion)

    Unnamed: 0_x    ID Gender     City  Age First_name  Last_name  \
0              0  A001      M    Paris   25       John      Alter
1              0  A001      M    Paris   25       John      Alter
2              0  A001      M    Paris   25       John      Alter
3              1  A002      F   London   27      Alice  Luxumberg
4              1  A002      F   London   27      Alice  Luxumberg
5              2  A003      M   Berlin   29        Tom  Sabestine
6              2  A003      M   Berlin   29        Tom  Sabestine
7              2  A003      M   Berlin   29        Tom  Sabestine
8              3  A004      F  Newyork   31       Nina      Adgra
9              3  A004      F  Newyork   31       Nina      Adgra
10             3  A004      F  Newyork   31       Nina      Adgra
11             4  A005      F   Madrid   30        Amy      Johny
12             4  A005      F   Madrid   30        Amy      Johny
13             4  A005      F   Madrid   30        Amy      Johny

    Designation Level  Unnamed: 0_y     Project       Cost    Status
0                   2             0   Project 1  1002000.0  Finished
1                   2             8   Project 9  2210312.5   Ongoing
2                   2            10  Project 11  2000000.0    Failed
3                   2             1   Project 2  2000000.0   Ongoing
4                   2             5   Project 6   680000.0    Failed
5                   3             2   Project 3  4500000.0  Finished
6                   3             7   Project 8   350000.0    Failed
7                   3             9  Project 10   300000.0  Finished
8                   3             3   Project 4  5500000.0   Ongoing
9                   3            11  Project 12  1000000.0   Ongoing
10                  3            12  Project 13  3000000.0  Finished
11                  4             4   Project 5  3250500.0  Finished
12                  4             6   Project 7   400000.0  Finished
13                  4            13  Project 14   200000.0  Finished

Task 9: Aggregate total project cost per employee into TotalProjCost DataFrame
==

In [51]:
# Group by ID and First Name to sum all Project Costs and create a new DataFrame with the results  
total_proj_cost = final.groupby(['ID', 'First_name'], as_index=False)['Cost'].sum()  # group and sum costs  
# Rename the aggregated column to 'Total cost' to match the brief  # comment
total_proj_cost.rename(columns={'Cost': 'Total cost'}, inplace=True)  # rename summed column  
# Save the TotalProjCost DataFrame to CSV as requested  # comment
total_proj_cost.to_csv('TotalProjCost.csv', index=False)  # save aggregated totals to CSV

In [55]:
total_project_cost=pd.read_csv("TotalProjCost.csv")
print(total_project_cost)

     ID First_name  Total cost
0  A001       John   5212312.5
1  A002      Alice   2680000.0
2  A003        Tom   5150000.0
3  A004       Nina   9500000.0
4  A005        Amy   3850500.0

Task 10: Print employee details whose city contains the letter 'o'
=

In [57]:
# Filter final rows where the City name contains letter 'o' (case-insensitive)  
city_o_mask = final['City'].str.contains('o', case=False, na=False)  # create boolean mask for cities containing 'o'  
employees_with_o = final[city_o_mask].copy()  # select matching rows  
# Display the selected rows so the user can see the result (in notebook this will render as a table)  # comment
print('\nEmployees whose city contains the letter "o":\n')  # print header message  
print(employees_with_o)  # print the filtered dataframe  
# Save this filtered result also to CSV for convenience  
employees_with_o.to_csv('Employees_city_with_o.csv', index=False)  # save filtered employees to CSV

Employees whose city contains the letter "o":

    Unnamed: 0_x    ID Gender     City  Age First_name  Last_name  \
3              1  A002      F   London   27      Alice  Luxumberg
4              1  A002      F   London   27      Alice  Luxumberg
8              3  A004      F  Newyork   31       Nina      Adgra
9              3  A004      F  Newyork   31       Nina      Adgra
10             3  A004      F  Newyork   31       Nina      Adgra

    Designation Level  Unnamed: 0_y     Project       Cost    Status
3                   2             1   Project 2  2000000.0   Ongoing
4                   2             5   Project 6   680000.0    Failed
8                   3             3   Project 4  5500000.0   Ongoing
9                   3            11  Project 12  1000000.0   Ongoing
10                  3            12  Project 13  3000000.0  Finished